Repository: robertoszek/pleroma-bot
Catalog: pleroma_bot/locale/*/LC_MESSAGES/pleroma_bot.po
Languages: es

source: The file lock '{}' could not be acquired. Is another instance of pleroma-bot running?
es: El bloqueo del fichero '{}' no pudo ser adquirido. ¿Hay otra instancia de pleroma-bot en ejecución?

source: Post in Misskey: {}
es: Publicando en Misskey {}

source: No posts were found in the target Fediverse account
es: No se han encontrado posts en la cuenta de Fediverso objectivo

source: Exception occurred Media size too large: Filename: {file} Size: {size}MB Consider increasing the attachment size limit of your instance
es: Se ha producido una excepción Tamaño demasiado grande: Nombre de fichero: {file} Tamaño: {size}MB Considere aumentar el límite de tamaño de adjuntos para su instancia

source: Exception occurred Unprocessable Entity {error} File: {file}
es: Se produjo una excepción Entidad no procesable {error} Archivo: {file}

source: Total number of metadata fields cannot exceed 4. Provided: {}. Exiting...
es: El número de campos de metadatos no puede ser superior a 4. Se han introducido {}. Saliendo...

source: Exception occurred Error code 422 (Unprocessable Entity) Please check that the bio text or the metadata fields text aren't too long.
es: Se produjo una excepción Código de error 422 (Entidad no procesable) Por favor compruebe que el texto de biografía o el texto de los campos de metadatos no se muy largo.

source: Updating profile: {}
es: Actualizando perfil: {}

source: Pinning post: {}
es: Fijando post: {}

source: Unpinning previous: {}
es: Desfijando anterior: {}

source: File with previous pinned post ID not found or empty. Checking last posts for pinned post...
es: No se ha encontrado el archivo con el ID del anterior post fijado. Revisando últimos posts...

source: Unpinned: {}
es: Desfijado: {}

source: Pinned post not found. Giving up unpinning...
es: Post fijado no encontrado. Dejamos de intentar el desfijado...

source: Error uploading media: {}
es: Error mientras subiendo contenido: {}

source: Post in Pleroma: {}
es: Publicando en Pleroma {}

source: Post text longer than allowed ({}), truncating...
es: El texto del post es más largo que el permitido ({}), truncando...

source: Giving up, reference is too deep
es: Dándose por vencido, la referencia está demasiado anidada

source: Exception occurred Media not found (404) {tweet} - {media_url} Ignoring attachment and continuing...
es: Se ha producido una excepción Contenido no encontrado (404) {tweet} - {media_url} Ignorando el adjunto y continuando...

source: Media possibly geoblocked? (403) Skipping... {tweet} - {media_url}
es: ¿Contenido no disponible en tu ubicación? (403) Omitiendo... {tweet} - {media_url}

source: Attachment exceeded config file size limit ({})
es: Contenido adjunto ha excedido el límite configurado ({})

source: File size: {}MB
es: Tamaño de fichero: {}MB

source: Ignoring attachment and continuing...
es: Ignorando adjunto y continuando...

source: Couldn't expand the url {}: {}
es: No se pudo expandir la URL {}: {}

source: Couldn't expand the url: {}
es: No se pudo expandir la URL: {}

source: Rate limit exceeded. 0 out of {} requests remaining until {} UTC
es: Límite excedido. 0 de {} peticiones restantes hasta {} UTC

source: Sleeping for {}s...
es: Esperando {} segundos...

source: API version not supported: {}
es: Versión de API no soportada: {}

source: max_tweets must be between 10 and 3200. max_tweets: {}
es: El valor de max_tweets debe estar entre 10 y 3200. max_tweets: {}

source: Gathering tweets...
es: Recopilando tweets...

source: Processing tweets...
es: Procesando tweets...

source: Attempting to acquire lock {} on {}
es: Intentando adquirir el bloqueo {} en {}

source: Lock {} acquired on {}
es: Bloqueo {} adquirido en {}

source: Timeout on acquiring lock {} on {}
es: Tiempo de espera excedido al intentar adquirir el bloqueo {} en {}

source: Lock {} not acquired on {}, waiting {} seconds ...
es: Bloqueo {} no adquirido en {}, esperando {} segundos ...

source: Attempting to release lock {} on {}
es: Intentando liberar el bloqueo {} en {}

source: Lock {} released on {}
es: Bloqueo {} liberado en {}

source: Current pinned: {}
es: Fijado actualmente: {}

source: Previous pinned: {}
es: Fijado anteriormente: {}

source: Instance appears to be Misskey ฅ^•ﻌ•^ฅ
es: La instancia parece ser de tipo Misskey ฅ^•ﻌ•^ฅ

source: Instance response was not understood {}
es: La respuesta de la instancia no ha podido ser interpretada {}

source: Target instance is Mastodon...
es: La instancia objetivo es Mastodon...

source: Mastodon doesn't support display names longer than 30 characters, truncating it and trying again...
es: Mastodon no soporta nombres para mostrar de más de 30 caracteres, truncándolo e intentándolo de nuevo...

source: Mastodon doesn't support rich text. Disabling it...
es: Mastodon no soporta texto enriquecido. Desactivándolo...

source: How far back should we retrieve tweets from the Twitter account?
es: ¿Desde cuándo deberíamos recopilar los tweets de la cuenta de Twitter?

source: Enter a date (YYYY-MM-DD): [Leave it empty to retrieve *ALL* tweets or enter 'continue' if you want the bot to execute as normal (checking date of last post in the Fediverse account)]
es: Introduce una fecha (AAAA-MM-DD): [Déjalo en blanco si quieres que se recopilen *TODOS* los tweets ó introduce 'continue' si quieres que el bot se comporte como de costumbre (comprobando la fecha del último post de la cuenta del Fediverso)]

source: Raising max_tweets to the maximum allowed value
es: Aumentando max_tweets al valor máximo admitido

source: No Pleroma URL defined in config! [pleroma_base_url]
es: ¡No se ha definido la URL de Pleroma en la configuración! [pleroma_base_url]

source: Some or all OAuth 1.0a tokens missing, falling back to application-only authentication
es: No todos los tokens OAuth 1.0a han sido encontrados. Usando autenticación de aplicación en su lugar

source: Visibility not supported! Values allowed are: {}
es: Visibilidad introducida no soportada. Valores válidos: {}

source: Bot for mirroring one or multiple Twitter accounts in Pleroma/Mastodon.
es: Bot para replicar una o varias cuentas de Twitter en Pleroma/Mastodon.

source: path of config file (config.yml) to use and parse. If not specified, it will try to find it in the current working directory.
es: ruta del fichero de configuración (config.yml) a usar e interpretar. Si no se especifica, se intentará usar el del directorio de trabajo actual.

source: run in daemon mode. By default it will re-run every 60min. You can control this with --pollrate
es: correr en modo daemon. Por defecto será relanzado cada 60 minutos. Puede controlar la frecuencia con --pollrate

source: only applies to daemon mode. How often to run the program in the background (in minutes). By default is 60min.
es: sólo aplica a modo daemon. Frecuencia con la que correr el programa de fondo (en minutos). Por defecto es 60 minutos.

source: path of log file (error.log) to create. If not specified, it will try to store it at your config file path
es: ruta del fichero de log (error.log) a escribir. Si no se especifica, se intentará usar la ruta en la que se encuentra el fichero de configuración

source: skips Fediverse profile update (no background image, profile image, bio text, etc.)
es: omite la actualización de perfil en la cuenta del Fediverso (imagen de fondo, imagen de perfil, biografía, etc.)

source: forces the tweet retrieval to start from a specific date. The twitter_username value (FORCEDATE) can be supplied to only force it for that particular user in the config. Instead of the twitter_username a date (YYYY-MM-DD) can also be supplied to force that date for *all* users
es: fuerza una fecha específica de comienzo para la recopilación de tweets. El valor de twitter_username (FORCEDATE) puede ser introducido para forzar la fecha de inicio de recopilación sólo para ese usuario específico del archivo de configuración. En lugar de twitter_username se puede proporcionar una fecha (AAAA-MM-DD) para forzar esa fecha en *todos* los usuarios

source: skips first run checks
es: omite las validaciones de la primera ejecución

source: path of the Twitter archive file (zip) to use for posting tweets.
es: ruta del fichero de archivo de Twitter (zip) a usar para publicar tweets.

source: Debug logging enabled
es: Modo de depuración activado

source: config path: {}
es: ruta de configuración: {}

source: tweets temp folder: {}
es: carpeta temporal de tweets: {}

source: Multiple twitter users for one Fediverse account, skipping profile and pinned tweet.
es: Varios usuarios de Twitter definidos para una cuenta de Fediverso, omitiendo la actualización de perfil y tweet fijado.

source: Processing user: {}
es: Procesando usuario: {}

source: It seems like pleroma-bot is running for the first time for this Twitter user: {}
es: Parece que pleroma-bot está ejecutándose por primera vez para este usuario: {}

source: Invalid forceDate format, use "YYYY-mm-dd"
es: Formato inválido en forceDate, use "AAAA-MM-DD"

source: Using RSS feed. The following features will not be available: - Profile update - Pinned tweets - Polls
es: Usando fuente RSS. Las siguientes funcionalidades no estarán disponibles: - Actualización de perfil - Tweets fijados - Encuestas

source: Unable to retrieve tweets. Is the account protected? If so, you need to provide the following OAuth 1.0a fields in the user config: - consumer_key - consumer_secret - access_token_key - access_token_secret
es: No se han podido recopilar los tweets. ¿Está la cuenta protegida? Si lo está, necesita proporcionar los siguientes valores de OAuth 1.0a en la configuración: - consumer_key - consumer_secret - access_token_key - access_token_secret

source: tweets gathered: {}
es: tweets recopilados: {}

source: tweets to post: {}
es: tweets a publicar: {}

source: Multiple twitter users, not updating profile
es: Varios usuarios de Twitter, omitiendo actualizado de perfil

source: Exception occurred for user, skipping...
es: Se produjo una excepción para este usuario, omitiendo...

source: Exception occurred
es: Se produjo una excepción
